src/Documents/ДвижениеТранзита/ДвижениеТранзита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвижениеТранзита</name>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>AccumulationRegister.Возвраты</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОпераций_ДвижениеТранзита</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПокупкиТранзит</name>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
        <types>CatalogRef.Посылки</types>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Точка</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.Движение</types>
        <types>DocumentRef.ФормированиеКоробки</types>
        <types>DocumentRef.КорректировкаЗаписейРегистров</types>
        <types>DocumentRef.Приходная</types>
        <types>DocumentRef.РазборКоробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГабаритНазначение</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХраненияНазначение</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаНазначение</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.Организаторы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/Транзит/Транзит.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Транзит</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПокупкаСсылка</name>
    <type>
      <types>CatalogRef.Покупки</types>
      <types>CatalogRef.Заказы</types>
      <types>CatalogRef.Посылки</types>
      <types>CatalogRef.Пристрой</types>
      <types>CatalogRef.Коробки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Точка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Движение</types>
      <types>DocumentRef.ФормированиеКоробки</types>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      <types>DocumentRef.ОтправлениеТранзита</types>
      <types>DocumentRef.Приходная</types>
      <types>DocumentRef.ПоступлениеПристроя</types>
      <types>DocumentRef.РазборКоробки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/Возвраты/Возвраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Возвраты</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Участники</types>
      <types>CatalogRef.Организаторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Покупка</name>
    <type>
      <types>CatalogRef.Покупки</types>
      <types>CatalogRef.Заказы</types>
      <types>CatalogRef.Посылки</types>
      <types>CatalogRef.Коробки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ВозвратГруппОрганизатору</types>
      <types>DocumentRef.ВозвратПокупокОрганизатору</types>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      <types>DocumentRef.ДвижениеТранзита</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыОпераций_ДвижениеТранзита/ВидыОпераций_ДвижениеТранзита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОпераций_ДвижениеТранзита</name>
  <enumValues>
    <name>ТранзитНаТранзит</name>
  </enumValues>
  <enumValues>
    <name>ТранзитНаОстатки</name>
  </enumValues>
  <enumValues>
    <name>ТранзитНаВозврат</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ЗапросыГруппДоставки/ЗапросыГруппДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросыГруппДоставки</name>
  <attributes>
    <name>ОтправленныеДанные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученныеДанные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапросыОтсрочки</name>
    <attributes>
      <name>ГруппаДоставки</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Успех</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗапросыИсключения</name>
    <attributes>
      <name>ГруппаДоставки</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Успех</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеУдаления</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗапросыУдаления</name>
    <attributes>
      <name>ГруппаДоставки</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Успех</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеУдаления</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗапросыОплаты</name>
    <attributes>
      <name>ГруппаДоставки</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Успех</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставкиПредоплата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВзвешивания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПротоколыПередач</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ДвижениеТранзита/ObjectModule.bsl
Процедура ЗаполнитьЗаказамиДруихТочек() Экспорт
	стрВозврата=СтоСПОбмен_ГруппыДоставки.ЗаказыДругихТочек_ПроверитьОстатки();	
	Если стрВозврата.Авторизация Тогда
		ПокупкиТранзит.Загрузить(стрВозврата.ЗаказыДругихТочек);
		ВидОперации=Перечисления.ВидыОпераций_ДвижениеТранзита.ТранзитНаТранзит;
		Комментарий="Друнгая точка сбора. Автоматически.";
	КонецЕсли
КонецПроцедуры


Процедура ЗаполнитьЗаказамиДляВозврата(МассДляОтправления) Экспорт
	Если МассДляОтправления.Количество()=0 Тогда
		Возврат;
	КонецЕсли; 	
	ГД=МассДляОтправления[0];
	//Перепроводим Документы по группам из которых удаляли заказы чтоб они вернулись на транзит
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтправлениеТранзита.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОтправлениеТранзита КАК ОтправлениеТранзита
		|ГДЕ
		|	ОтправлениеТранзита.Проведен
		|	И ОтправлениеТранзита.Коробка = &ГД";
	
	Запрос.УстановитьПараметр("ГД", ГД);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		об=Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			об.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	//Находим что удаляли из данной группы
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапросыГруппДоставкиЗапросыИсключения.Покупка КАК Покупка,
		|	ЗапросыГруппДоставкиЗапросыИсключения.Участник КАК Участник
		|ПОМЕСТИТЬ Заказы
		|ИЗ
		|	Документ.ЗапросыГруппДоставки.ЗапросыИсключения КАК ЗапросыГруппДоставкиЗапросыИсключения
		|ГДЕ
		|	ЗапросыГруппДоставкиЗапросыИсключения.Успех
		|	И ЗапросыГруппДоставкиЗапросыИсключения.ГруппаДоставки = &ГД
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапросыГруппДоставкиЗапросыИсключения.Покупка,
		|	ЗапросыГруппДоставкиЗапросыИсключения.Участник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Заказы.Покупка КАК Покупка,
		|	Заказы.Участник КАК Участник,
		|	ТранзитОстатки.Габарит КАК Габарит,
		|	ТранзитОстатки.МестоХранения КАК МестоХранения,
		|	ТранзитОстатки.Партия КАК Партия,
		|	ТранзитОстатки.Точка КАК Точка,
		|	ТранзитОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	Заказы КАК Заказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Транзит.Остатки КАК ТранзитОстатки
		|		ПО Заказы.Покупка = ТранзитОстатки.ПокупкаСсылка
		|			И Заказы.Участник = ТранзитОстатки.Участник";
	
	Запрос.УстановитьПараметр("ГД", ГД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
    ПокупкиТранзит.Загрузить(РезультатЗапроса.Выгрузить());
	ВидОперации	= Перечисления.ВидыОпераций_ДвижениеТранзита.ТранзитНаВозврат;
	Для каждого стр из ПокупкиТранзит Цикл
		стр.Организатор	= СП_РаботаСоСправочниками.ПолучитьОрганизатораПо_Коду(стр.Покупка.Организатор.Код);		
	КонецЦикла;
	Комментарий="Возврат удаленных из группы. Автоматически.";
КонецПроцедуры	

Процедура ДвиженияТранзит_Списание(Отказ, Режим)
	// регистр Транзит Расход
	Движения.Транзит.Записывать = Истина;
	Для Каждого ТекСтрокаПокупкиТранзит Из ПокупкиТранзит Цикл
		Движение 				= Движения.Транзит.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.Габарит 		= ТекСтрокаПокупкиТранзит.Габарит;
		Движение.Участник 		= ТекСтрокаПокупкиТранзит.Участник;
		Движение.МестоХранения 	= ТекСтрокаПокупкиТранзит.МестоХранения;
		Движение.Партия 		= ТекСтрокаПокупкиТранзит.Партия;
		Движение.ПокупкаСсылка 	= ТекСтрокаПокупкиТранзит.Покупка;
		Движение.Точка 			= ТекСтрокаПокупкиТранзит.Точка;
		Движение.Количество 	= ТекСтрокаПокупкиТранзит.Количество;
	КонецЦикла;
КонецПроцедуры

Процедура ДвиженияТранзит_Поступление(Отказ, Режим)	
	// регистр Транзит Приход
	Движения.Транзит.Записывать = Истина;	
	Для Каждого ТекСтрокаПокупкиТранзит Из ПокупкиТранзит Цикл
		Движение = Движения.Транзит.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Габарит = ТекСтрокаПокупкиТранзит.ГабаритНазначение;
		Движение.Участник = ТекСтрокаПокупкиТранзит.Участник;
		Движение.МестоХранения = ТекСтрокаПокупкиТранзит.МестоХраненияНазначение;
		Движение.Партия = ТекСтрокаПокупкиТранзит.Партия;
		Движение.ПокупкаСсылка = ТекСтрокаПокупкиТранзит.Покупка;
		Движение.Точка = ТекСтрокаПокупкиТранзит.ТочкаНазначение;
		Движение.Количество = ТекСтрокаПокупкиТранзит.Количество;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ДвиженияТранзит_Списание(Отказ, РежимПроведения);
	Если ВидОперации=Перечисления.ВидыОпераций_ДвижениеТранзита.ТранзитНаТранзит Тогда
		ДвиженияТранзит_Поступление(Отказ, РежимПроведения);
	ИначеЕсли ВидОперации=Перечисления.ВидыОпераций_ДвижениеТранзита.ТранзитНаВозврат Тогда	
		ДвиженияВозврат_Поступление(Отказ, РежимПроведения);
	Конецесли;		
КонецПроцедуры

Процедура ДвиженияВозврат_Поступление(Отказ, Режим)
	// регистр Возвраты Приход
	Движения.Возвраты.Записывать = Истина;
	Для Каждого ТекСтрокаПокупкиТранзит Из ПокупкиТранзит Цикл
		Движение 			= Движения.Возвраты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организатор = ТекСтрокаПокупкиТранзит.Организатор;
		Движение.Участник = ТекСтрокаПокупкиТранзит.Участник;
		Движение.Покупка = ТекСтрокаПокупкиТранзит.Покупка;
		Движение.МестоХранения = ТекСтрокаПокупкиТранзит.МестоХранения;
		Движение.Партия = ТекСтрокаПокупкиТранзит.Партия;
		Движение.Количество = ТекСтрокаПокупкиТранзит.Количество;
	КонецЦикла;
КонецПроцедуры
